#!/usr/bin/env ruby

i = 45
puts "原值: #{i}"

i_b = i.to_s(2)
puts "二进制表示: #{i_b}"

i_1 = (i >> 1).to_s(2)
puts "去掉最后一位(x >> 1): #{i_1}"

i_2 = (i << 1).to_s(2)
puts "最后加一个0(x << 1): #{i_2}"

i_3 = ((i << 1) + 1).to_s(2)
puts "最后加一个1(x << 1 + 1): #{i_3}"

i = 45
i_4 = ((i | 1) - 1).to_s(2)
puts "把最后一位变成0((x | 1) - 1): #{i_4}"
puts ''

j = 46
j_b = 46.to_s(2)
puts "原值: #{j}"
puts "二进制表示: #{j_b}"

j_4 = (j | 1).to_s(2)
puts "把最后一位变成1(x | 1): #{j_4}"

j_5 = (j ^ 1).to_s(2)
puts "最后一位取反(x ^ 1): #{j_5}"

j_6 = (j | (1 << (5-1))).to_s(2)
puts "将从右往左第5位变成1(x | (1 << (5-1))): #{j_6}"

j_7 = (j & ~(1 << (4-1))).to_s(2)
puts "将从右往左第4位变成0(x & ~(1 << (4-1))): #{j_7}"

j_8 = (j ^ (1 << (3-1))).to_s(2)
puts "将从右往左第3位取反(j ^ (1 << (3-1))): #{j_8}"

j_9 = (j ^ (1 << (3-1))).to_s(2)
puts "将从右往左第3位取反(j ^ (1 << (3-1))): #{j_9}"
